Revit 2024 API
ModelCurveArray Class
An array that contains model curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ModelCurveArray : APIObject,
	IEnumerable
Visual Basic
Public Class ModelCurveArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class ModelCurveArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ModelCurveArray
See Also
ModelCurveArray Members
Autodesk.Revit.DB Namespace